
"use strict"


let someVar = 0;
++someVar;

if (someVar) {
	console.log(someVar);
}

// відповідь: 1


for (let i = 0; i <= 10; i++){
    console.log(`Пункт №${i}`);
}


// Задача №3
// Що потрапить в консоль ?
if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
	console.log('000');
}

/* відповідь 
1. 2 * 20 <= 10 - false (40 більше за 10)
2. 30 / 2 < 5 && 10 <= "10" - false і true
3. 20 === "20" -  false бо іде суворе порівнення і тип данних залишається ("10" - не переводиться в тип данних num)
4. не виведе консол лог через перший пункт.
*/


// Задача №4
// Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
// Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.

function sigma(a, b) {
    if (isNaN(a) || isNaN(b)) {
        console.log('перевірте правильність написання');
    } else if (a || b) {
        console.log(`Результат ділення ${a / b}`);
    }else {
        console.log('перевірте правильність написання');
    }
}
sigma();


// Задача №5
// Створіть масив даних - 5 елементів, один з яких число 10
// Обробіть масив за допомогою методу перебору
// Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль


let list = [1,2,11,40,5];
let x = 10;

for(let i = 0; i<=list.length;i++){
    if(list[i] === x){
        console.log(x)
        break
    }else if(i==list.length){
        console.log('ваше чісло не знайдено')
    }
}




